; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	spectrograph6 - mode
	thermograph5 - mode
	image3 - mode
	infrared0 - mode
	thermograph2 - mode
	infrared4 - mode
	thermograph1 - mode
	Star0 - direction
	GroundStation1 - direction
	Star2 - direction
	GroundStation3 - direction
	Star4 - direction
	Star5 - direction
	Star8 - direction
	GroundStation10 - direction
	Star11 - direction
	Star12 - direction
	GroundStation13 - direction
	GroundStation6 - direction
	Star9 - direction
	GroundStation7 - direction
	Phenomenon14 - direction
	Star15 - direction
	Phenomenon16 - direction
	Planet17 - direction
)
(:init
	(supports instrument0 thermograph1)
	(supports instrument0 thermograph2)
	(supports instrument0 image3)
	(supports instrument0 infrared4)
	(supports instrument0 infrared0)
	(supports instrument0 thermograph5)
	(supports instrument0 spectrograph6)
	(calibration_target instrument0 GroundStation7)
	(calibration_target instrument0 Star9)
	(calibration_target instrument0 GroundStation6)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation7)
)
(:goal (and
	(pointing satellite0 Phenomenon14)
	(have_image Phenomenon14 image3)
	(have_image Star15 infrared0)
	(have_image Star15 infrared4)
	(have_image Phenomenon16 thermograph1)
	(have_image Phenomenon16 infrared4)
	(have_image Planet17 image3)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 7
2. (calibrate satellite0 instrument0 groundstation7)
   added: (calibrated instrument0)
   goals met: 0 of 7
3. (turn_to satellite0 phenomenon14 groundstation7)
   deleted: (pointing satellite0 groundstation7)
   added: (pointing satellite0 phenomenon14)
   goals met: 1 of 7
4. (take_image satellite0 phenomenon14 instrument0 image3)
   added: (have_image phenomenon14 image3)
   goals met: 2 of 7
5. (turn_to satellite0 phenomenon16 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 phenomenon16)
   goals met: 1 of 7
6. (take_image satellite0 phenomenon16 instrument0 infrared4)
   added: (have_image phenomenon16 infrared4)
   goals met: 2 of 7
7. (take_image satellite0 phenomenon16 instrument0 thermograph1)
   added: (have_image phenomenon16 thermograph1)
   goals met: 3 of 7
8. (turn_to satellite0 phenomenon14 phenomenon16)
   deleted: (pointing satellite0 phenomenon16)
   added: (pointing satellite0 phenomenon14)
   goals met: 4 of 7
9. (turn_to satellite0 planet17 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 planet17)
   goals met: 3 of 7
10. (take_image satellite0 planet17 instrument0 image3)
   added: (have_image planet17 image3)
   goals met: 4 of 7
11. (turn_to satellite0 phenomenon14 planet17)
   deleted: (pointing satellite0 planet17)
   added: (pointing satellite0 phenomenon14)
   goals met: 5 of 7
12. (turn_to satellite0 star15 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 star15)
   goals met: 4 of 7
13. (take_image satellite0 star15 instrument0 infrared0)
   added: (have_image star15 infrared0)
   goals met: 5 of 7
14. (take_image satellite0 star15 instrument0 infrared4)
   added: (have_image star15 infrared4)
   goals met: 6 of 7
15. (turn_to satellite0 phenomenon14 star15)
   deleted: (pointing satellite0 star15)
   added: (pointing satellite0 phenomenon14)
   goals met: 7 of 7
